{
  "nav": {
    "main": "Главная",
    "skills": "Навыки",
    "projects": "Проекты",
    "contacts": "Контакты"
  },
  "mainBlock": {
    "welcome": "Добро пожаловать",
    "hi": "Привет, я ",
    "name": "Алексей Федоров",
    "a": "",
    "profession": "Фронтенд разработчик.",
    "aboutMe": "У меня есть опыт создания SPA на React, Redux, TypeScript. Сейчас я совершенствую свои навыки в этом направлении и расширяю их новыми технологиями. В свободное время я занимаюсь образовательными книгами, решаю задачи на Codewars и также улучшаю свой английский. Открыт для ваших предложений."
  },
  "skillsBlock": {
    "subtitle": "Особенности",
    "title": "Навыки",
    "skills": {
      "react": {
        "title": "React",
        "description": "React (также известный как React.js или ReactJS) — это бесплатная и открытая библиотека JavaScript для создания пользовательских интерфейсов на основе компонентов."
      },
      "chatGPT": {
        "title": "ChatGPT",
        "description": "ChatGPT — это модель разговорного ИИ, разработанная OpenAI на основе архитектуры Generative Pretrained Transformer 3 (GPT-3)."
      },
      "restApi": {
        "title": "REST API",
        "description": "REST API — это набор правил, позволяющих программам взаимодействовать друг с другом."
      },
      "redux": {
        "title": "Redux",
        "description": "Redux — это предсказуемый контейнер состояния для JavaScript приложений."
      },
      "mobx": {
        "title": "MobX",
        "description": "MobX — это библиотека управления состоянием для JavaScript приложений. Она предоставляет простой и масштабируемый способ управления состоянием вашего приложения и синхронизации его с пользовательским интерфейсом."
      }
    }
  },
  "projectsBlock": {
    "subtitle": "Посетите мои проекты",
    "title": "Проекты",
    "projects": {
      "todoList": {
        "title": "TodoList",
        "description": "Стек: TypeScript, React, Redux toolkit, Redux-Thunk, React Router DOM, Axios, Formik, MUI, Storybook"
      },
      "socialNetwork": {
        "title": "Социальная сеть",
        "description": "Стек: TypeScript, React, React Router DOM"
      },
      "cats": {
        "title": "Кошки",
        "description": "Кошки (также известные как домашние кошки или кошки-комнаты для различия от других представителей семейства кошачьих), — это небольшие одомашненные плотоядные млекопитающие, ценимые людьми за их дружелюбие и способность охотиться на вредителей и домашнюю мелкую грызуную дичь."
      }
    }
  },
  "contactBlock": {
    "subtitle": "Контакты",
    "title": "Свяжитесь со мной",
    "form": {
      "name": "Ваше Имя",
      "email": "Email",
      "message": "Ваше Сообщение",
      "button": "Отправить Сообщение"
    },
    "success": "Ваше сообщение отправлено",
    "error": "Это поле обязательно к заполнению",
    "info": "Или свяжитесь со мной более удобным для вас способом"
  },
  "footer": {
    "info": "Спроектировано и разработано Алексеем Федоровым 2025"
  }
}
