{
  "nav": {
    "main": "Главная",
    "skills": "Навыки",
    "projects": "Проекты",
    "contacts": "Контакты"
  },
  "mainBlock": {
    "welcome": "Добро пожаловать",
    "hi": "Привет, я ",
    "name": "Алексей Федоров",
    "a": "",
    "profession": "Frontend-разработчик.",
    "aboutMe": "Frontend-разработчик с опытом работы более 1 года в создании SPA с использованием JavaScript, TypeScript, React, Redux, Redux Toolkit и других связанных библиотек. Сейчас я активно совершенствую свои навыки и расширяю их новыми технологиями. Стремлюсь и дальше углубленно развиваться в области frontend-разработки."
  },
  "skillsBlock": {
    "subtitle": "Особенности",
    "title": "Навыки",
    "skills": {
      "react": {
        "title": "React",
        "description": "React — это библиотека для создания интерактивных пользовательских интерфейсов, используя компоненты и виртуальный DOM для повышения производительности."
      },
      "js": {
        "title": "JS",
        "description": "JavaScript — это универсальный язык программирования, используемый для создания динамичного и интерактивного контента на веб-сайтах, позволяя обновлениям происходить в реальном времени без перезагрузки страниц."
      },
      "ts": {
        "title": "TS",
        "description": "TypeScript — это надстройка над JavaScript, добавляющая статическую типизацию, что помогает обнаруживать ошибки на стадии разработки и улучшает поддержку кода в больших проектах."
      },
      "redux": {
        "title": "Redux",
        "description": "Redux — это библиотека для управления состоянием в JavaScript-приложениях. Она помогает управлять состоянием приложения в централизованном хранилище, делая изменения состояния предсказуемыми и упрощая отладку."
      },
      "reduxToolkit": {
        "title": "Redux Toolkit",
        "description": "Redux Toolkit — это набор инструментов для упрощения работы с Redux. Он предоставляет удобные функции и методы для ускорения разработки, улучшая код и снижая количество boilerplate-кода."
      },
      "axios": {
        "title": "Axios",
        "description": "Axios — это библиотека на JavaScript, основанная на промисах, которая используется для выполнения HTTP-запросов, таких как получение данных с API. Она упрощает работу с асинхронным кодом и эффективно обрабатывает запросы и ответы."
      },
      "git": {
        "title": "Git",
        "description": "Git — это распределённая система управления версиями, которая позволяет отслеживать изменения в коде и совместно работать над проектами."
      },
      "storybook": {
        "title": "Storybook",
        "description": "Storybook — это открытый инструмент для создания и тестирования UI-компонентов в изоляции. Он позволяет разработчикам создавать, просматривать и тестировать компоненты независимо от основного приложения."
      },
      "html": {
        "title": "HTML",
        "description": "HyperText Markup Language — это стандартный язык разметки для создания веб-страниц, который описывает структуру и содержание документов в интернете."
      },
      "css": {
        "title": "CSS",
        "description": "Cascading Style Sheets — это язык таблиц стилей, используемый для описания внешнего вида и оформления HTML-документов, таких как шрифты, цвета и отступы."
      },
      "sass": {
        "title": "SASS",
        "description": "Syntactically Awesome Stylesheets — это препроцессор для CSS, который добавляет дополнительные возможности, такие как переменные, вложенные правила и миксины, для улучшения и ускорения написания стилей."
      },
      "rhf": {
        "title": "React Hook Form",
        "description": "React Hook Form — это библиотека для управления формами в React, которая упрощает валидацию и обработку данных формы с минимальными перерисовками и высокой производительностью."
      },
      "rrd": {
        "title": "React Router Dom",
        "description": "React Router DOM — это библиотека для обработки навигации и маршрутизации в веб-приложениях на React, позволяющая пользователям переключаться между различными страницами в зависимости от URL."
      },
      "mui": {
        "title": "Material UI",
        "description": "Material UI — это библиотека компонентов для React, которая реализует Google Material Design, предлагая готовые и настраиваемые UI-элементы для создания красивых и функциональных веб-приложений."
      },
      "rAPI": {
        "title": "Rest API",
        "description": "Representational State Transfer Application Programming Interface — это архитектурный стиль для создания веб-сервисов, который использует HTTP-запросы для взаимодействия между клиентом и сервером, работая с ресурсами в виде URL-адресов."
      }
    }
  },
  "projectsBlock": {
    "subtitle": "Посетите мои проекты",
    "title": "Проекты",
    "projects": {
      "todoList": {
        "title": "TodoList",
        "description": "Стек: TypeScript, React, Redux toolkit, Redux-Thunk, React Router DOM, Axios, Formik, MUI, Storybook"
      },
      "socialNetwork": {
        "title": "Социальная сеть",
        "description": "Стек: TypeScript, React, React Router DOM"
      },
      "cats": {
        "title": "Кошки",
        "description": "Кошки (также известные как домашние кошки или кошки-комнаты для различия от других представителей семейства кошачьих), — это небольшие одомашненные плотоядные млекопитающие, ценимые людьми за их дружелюбие и способность охотиться на вредителей и домашнюю мелкую грызуную дичь."
      }
    }
  },
  "contactBlock": {
    "subtitle": "Контакты",
    "title": "Свяжитесь со мной",
    "form": {
      "name": "Ваше Имя",
      "email": "Email",
      "message": "Ваше Сообщение",
      "button": "Отправить Сообщение"
    },
    "success": "Ваше сообщение отправлено",
    "error": "Это поле обязательно к заполнению",
    "info": "Или свяжитесь со мной более удобным для вас способом"
  },
  "footer": {
    "info": "Спроектировано и разработано Алексеем Федоровым 2025"
  }
}
